; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v7 ?v4)
             (pred_7 ?v13 ?v2)
             (pred_1 ?v7 ?v2)
             (pred_9 ?v10 ?v7 )
	     (pred_5 ?v7)
             (pred_2 ?v11)
             (pred_12 ?v13)
             (pred_11 ?v2)
             (pred_8 ?v7)
             (pred_6 ?v13)
             (pred_10 ?v7)
             (pred_3 ))



(:action op_5
:parameters (?v1 ?v3 ?v5 ?v12)
:precondition (and (pred_2 ?v1) (pred_2 ?v3) (pred_12 ?v5) (pred_11 ?v12)
          (pred_4 ?v1 ?v3) (pred_7 ?v5 ?v12)
                   (pred_1 ?v3 ?v12) (pred_5 ?v1) 
                   (pred_8 ?v3) (pred_6 ?v5))
:effect (and  (pred_10 ?v3) (not (pred_8 ?v3))))


(:action op_2
:parameters (?v1 ?v6)
:precondition (and (pred_2 ?v1) (pred_2 ?v6)
               (pred_5 ?v1) (pred_4 ?v1 ?v6) (pred_10 ?v6))
:effect (and (pred_5 ?v6) (not (pred_5 ?v1))))

(:action op_3
:parameters (?v1 ?v5)
:precondition (and (pred_2 ?v1) (pred_12 ?v5) 
                  (pred_5 ?v1) (pred_9 ?v5 ?v1) (pred_3 ))
:effect (and (pred_6 ?v5)
   (not (pred_9 ?v5 ?v1)) (not (pred_3 ))))


(:action op_1
:parameters (?v1 ?v9 ?v8)
:precondition (and (pred_2 ?v1) (pred_12 ?v9) (pred_12 ?v8)
                  (pred_5 ?v1) (pred_6 ?v8) (pred_9 ?v9 ?v1))
:effect (and (pred_6 ?v9) (pred_9 ?v8 ?v1)
        (not (pred_6 ?v8)) (not (pred_9 ?v9 ?v1))))

(:action op_4
:parameters (?v1 ?v5)
:precondition (and (pred_2 ?v1) (pred_12 ?v5) 
                  (pred_5 ?v1) (pred_6 ?v5))
:effect (and (pred_3 ) (pred_9 ?v5 ?v1) (not (pred_6 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_07 obj_22 obj_08 obj_15 obj_02 obj_09 obj_20 obj_18 obj_10 obj_04 obj_12 obj_16 obj_19 obj_05 obj_13
    obj_06 obj_14 obj_21
    obj_01 obj_03 obj_11
    )

    (:init
       (pred_3)

       (pred_2 obj_17)
       (pred_2 obj_07)
       (pred_2 obj_22)
       (pred_2 obj_08)
       (pred_2 obj_15)
       (pred_2 obj_02)
       (pred_2 obj_09)
       (pred_2 obj_20)
       (pred_2 obj_18)
       (pred_2 obj_10)
       (pred_2 obj_04)
       (pred_2 obj_12)
       (pred_2 obj_16)
       (pred_2 obj_19)
       (pred_2 obj_05)
       (pred_2 obj_13)
       (pred_11 obj_06)
       (pred_11 obj_14)
       (pred_11 obj_21)
       (pred_12 obj_01)
       (pred_12 obj_03)
       (pred_12 obj_11)

       (pred_4 obj_17 obj_15)
       (pred_4 obj_17 obj_07)
       (pred_4 obj_07 obj_02)
       (pred_4 obj_07 obj_22)
       (pred_4 obj_07 obj_17)
       (pred_4 obj_22 obj_09)
       (pred_4 obj_22 obj_08)
       (pred_4 obj_22 obj_07)
       (pred_4 obj_08 obj_20)
       (pred_4 obj_08 obj_22)
       (pred_4 obj_15 obj_18)
       (pred_4 obj_15 obj_02)
       (pred_4 obj_15 obj_17)
       (pred_4 obj_02 obj_10)
       (pred_4 obj_02 obj_09)
       (pred_4 obj_02 obj_07)
       (pred_4 obj_02 obj_15)
       (pred_4 obj_09 obj_04)
       (pred_4 obj_09 obj_20)
       (pred_4 obj_09 obj_22)
       (pred_4 obj_09 obj_02)
       (pred_4 obj_20 obj_12)
       (pred_4 obj_20 obj_08)
       (pred_4 obj_20 obj_09)
       (pred_4 obj_18 obj_16)
       (pred_4 obj_18 obj_10)
       (pred_4 obj_18 obj_15)
       (pred_4 obj_10 obj_19)
       (pred_4 obj_10 obj_04)
       (pred_4 obj_10 obj_02)
       (pred_4 obj_10 obj_18)
       (pred_4 obj_04 obj_05)
       (pred_4 obj_04 obj_12)
       (pred_4 obj_04 obj_09)
       (pred_4 obj_04 obj_10)
       (pred_4 obj_12 obj_13)
       (pred_4 obj_12 obj_20)
       (pred_4 obj_12 obj_04)
       (pred_4 obj_16 obj_19)
       (pred_4 obj_16 obj_18)
       (pred_4 obj_19 obj_05)
       (pred_4 obj_19 obj_10)
       (pred_4 obj_19 obj_16)
       (pred_4 obj_05 obj_13)
       (pred_4 obj_05 obj_04)
       (pred_4 obj_05 obj_19)
       (pred_4 obj_13 obj_12)
       (pred_4 obj_13 obj_05)
       (pred_8 obj_10)
       (pred_8 obj_17)
       (pred_8 obj_16)
       (pred_1  obj_10 obj_06)
       (pred_1  obj_17 obj_14)
       (pred_1  obj_16 obj_21)
       (pred_10 obj_07)
       (pred_10 obj_22)
       (pred_10 obj_08)
       (pred_10 obj_15)
       (pred_10 obj_02)
       (pred_10 obj_09)
       (pred_10 obj_20)
       (pred_10 obj_18)
       (pred_10 obj_04)
       (pred_10 obj_12)
       (pred_10 obj_19)
       (pred_10 obj_05)
       (pred_10 obj_13)

       (pred_7  obj_01 obj_06)
       (pred_7  obj_03 obj_14)
       (pred_7  obj_11 obj_21)
       (pred_9 obj_01 obj_13)
       (pred_9 obj_03 obj_19)
       (pred_9 obj_11 obj_08)
       (pred_5 obj_07)
    )

    (:goal (and
       (pred_9 obj_01 obj_05)
       (pred_9 obj_03 obj_07)
    ))
(:constraints
  (always (not (pred_5 obj_04)))
)
)

; plan
1. (op_2 obj_07 obj_22)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_22)
   goals met: 0 of 2
2. (op_2 obj_22 obj_09)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_09)
   goals met: 0 of 2
3. (op_2 obj_09 obj_20)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_20)
   goals met: 0 of 2
4. (op_2 obj_20 obj_12)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_12)
   goals met: 0 of 2
5. (op_2 obj_12 obj_13)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_13)
   goals met: 0 of 2
6. (op_3 obj_13 obj_01)
   deleted: (pred_9 obj_01 obj_13) (pred_3)
   added: (pred_6 obj_01)
   goals met: 0 of 2
7. (op_2 obj_13 obj_05)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_05)
   goals met: 0 of 2
8. (op_4 obj_05 obj_01)
   deleted: (pred_6 obj_01)
   added: (pred_3) (pred_9 obj_01 obj_05)
   goals met: 1 of 2
9. (op_2 obj_05 obj_19)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_19)
   goals met: 1 of 2
10. (op_3 obj_19 obj_03)
   deleted: (pred_9 obj_03 obj_19) (pred_3)
   added: (pred_6 obj_03)
   goals met: 1 of 2
11. (op_2 obj_19 obj_05)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_05)
   goals met: 1 of 2
12. (op_2 obj_05 obj_13)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_13)
   goals met: 1 of 2
13. (op_2 obj_13 obj_12)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_12)
   goals met: 1 of 2
14. (op_2 obj_12 obj_20)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_20)
   goals met: 1 of 2
15. (op_2 obj_20 obj_08)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_08)
   goals met: 1 of 2
16. (op_2 obj_08 obj_22)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_22)
   goals met: 1 of 2
17. (op_2 obj_22 obj_07)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_07)
   goals met: 1 of 2
18. (op_4 obj_07 obj_03)
   deleted: (pred_6 obj_03)
   added: (pred_3) (pred_9 obj_03 obj_07)
   goals met: 2 of 2
